Tekla Open API Reference for Tekla Structures 2025
Text.TextAttributes.RulerWidth Property
 Gets or sets the width in paper coordinates of the ruler to be used in word wrapping.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double RulerWidth { get; set; }
Public Property RulerWidth As Double
	Get
	Set
Property Value
Type: Double
 The width of the ruler.
See Also
Reference
Text.TextAttributes Class
Tekla.Structures.Drawing Namespace